export var QuizDetail2={
    "সকল":["সকল"],
    "তথ্য ও যোগাযোগ প্রযুক্তি বিশ্ব ও বাংলাদেশ প্রেক্ষিত":
        ['বিশ্বগ্রাম','ভার্চুয়াল রিয়েলিটি','আর্টিফিসিয়াল ইন্টেলিজেন্স','রোবটিক্স','ক্রায়োসার্জারি','জেনেটিক ইঞ্জিনিয়ারিং','ন্যানোটেকনোলজি','বায়োইনফরমেটিক্স','ভার্চুয়াল রিয়েলিটি'],
    "কমিউনিকেশন সিস্টেম ও নেটওয়ার্কিং":
        ['কমিউনিকেশন সিস্টেম','ডাটা কমিউনিকেশন মাধ্যম','ওয়্যারলেস কমিউনিকেশন','মোবাইল যোগাযোগ','কম্পিউটার নেটওয়ার্কিং','নেটওয়ার্ক টপোলজি','ক্লাউড কম্পিউটিং'],
    "সংখ্যা পদ্ধতি ও ডিজিটাল ডিভাইস":
        ['লজিক গেট','সংখ্যা পদ্ধতি','কোড','বুলিয়ান অ্যালজেবরা','এনকোডার ডিকোডার','অ্যাডার','রেজিস্টার'],
    "ওয়েব ডিজাইন পরিচিতি ও HTML":
        ['হেডিং','টেক্সট ফরমেটিং','সাবস্ক্রিপ্ট ও সুপারস্ক্রিপ্ট','তালিকা বা লিস্ট','হাইপারলিংক','ছবি বা ইমেজ','সারণী বা টেবিল'],
    "প্রোগ্রামিং ভাষা ":
        ['প্রোগ্রামের ধারণা','প্রোগ্রামিং ল্যাংগুয়েজ','অনুবাদক'],
    "ডেটাবেজ ম্যানেজমেন্ট সিস্টেম":
        [],
     
    }



