import { Link } from 'react-router-dom/cjs/react-router-dom.min'

import { Chpt1SubDetail } from '../../../chapterSub/Chpt1Sub/Chpt1SubDetail'
import Footer from '../../../Footer/Footer'
import Nav from '../../../Nav/Nav'
import Newsletter from '../../../newsletter/Newsletter'
import TopBar from '../../../topbar/TopBar'
import "../GlobalVillage/GlobalVillage.css"

const GeneticEngineering = () => {
  return (
        <div>
            <TopBar/>
            <Nav/>
        <div className="container chapterOneMain">
            <div className="row chapterOneMain py-3">
                <div className="col-lg-9">
                <div className="booktop">
            <h1>প্রথম অধ্যায়</h1>
            <h3>তথ্য ও যোগাযোগ প্রযুক্তি : বিশ্ব ও বাংলাদেশ প্রেক্ষিত</h3>
            <h2>জেনেটিক ইঞ্জিনিয়ারিং (Genetic Engineering)</h2>
        </div>
        <p className='mt-4'>জীবদেহের জিনোমকে প্রয়োজন অনুযায়ী সাজিয়ে বা কোনো  নির্দিষ্ট  জিনকে  অন্য জীবের জিন দ্বারা প্রতিস্থাপন করে কাঙ্ক্ষিত বৈশিষ্ট্যের নতুন জীবকোষ তৈরি করার পদ্ধতি হচ্ছে জেনেটিক ইঞ্জিনিয়ারিং।</p>
        <p>কোন প্রাণীর কোষে অবস্থিত DNA -তে অনেক জিন থাকে। একটি জিন প্রাণীটির একটি বৈশিষ্ট্য নির্ধারণ করে, সুতরাং কোন জিন পরিবর্তন করে সেই প্রাণীর বৈশিষ্ট্য পরিবর্তন করা সম্ভব। </p>
        <p>ফসলী শস্যের কোন নির্দিষ্ট  জিন অন্য কোন বন্য জাতের জিন দ্বারা প্রতিস্থাপন করে দ্রুত ও অধিক ফলনশীল জাতের শস্য উৎপাদন সম্ভব হয়েছে। যেমনঃ IR8, IR28, IR29 প্রভৃতি। তাছাড়া রোগমুক্ত ও ভাইরাস প্রতিরোধী শস্য চারা তৈরি, ফসল বা ফলের বর্ণ, গঠন, স্বাদ ও পুষ্টিমান উন্নয়নেও জেনেটিক ইঞ্জিনিয়ারিং ব্যবহার করা হয়।</p>
        <p>বাংলাদেশী বিজ্ঞানী ড. মাকসুদুল আলম জেনেটিক ইঞ্জিনিয়ারিং প্রযুক্তির কল্যানে পাটের জেনোম সিকুয়েন্স আবিষ্কার করেন। ফলস্বরূপ, পাটের জীবন রহস্য উন্মোচিত হয়েছে। </p>
        
        <h4><b>জেনেটিক ইঞ্জিনিয়ারিং-এর ব্যবহার : </b></h4>
      
        <ul>
            <li >
            <b>উন্নতমানের ফসল উৎপাদন :</b> উন্নত জাতের ফসল উৎপাদনে জেনেটিক ইঞ্জিনিয়ারিং ব্যাপকভাবে ব্যবহৃত হচ্ছে। যেমন :           
            </li>
            <ul>
                <li>দ্রুত ও অধিক ফলনশীল জাতের শস্য উৎপাদন করা সম্ভব হচ্ছে। </li>
                <li>রোগমুক্ত ও ভাইরাস প্রতিরোধী শস্য চারা তৈরি করা যাচ্ছে। </li>
                <li>জিন পরিবর্তিত উন্নত শস্য চারা অধিক খরা ও ঠান্ডা সহ্য করতে পারে।</li>
                <li>ফসল বা ফলের বর্ণ, গঠন, স্বাদ ও পুষ্টিমান উন্নয়নে জেনিটিক ইঞ্জিনিয়ারিং ব্যবহার করা হচ্ছে।.</li>
            </ul>
            <li >
            <b>রোগের চিকিৎসা :</b> জিন থেরাপির মাধ্যমে রোগের চিকিৎসা এবং ত্রুটিপূর্ণভাবে জিন পরিবর্তন করে রোগীকে সুস্থ করে তোলা যায়।
            </li>
            <li >
            <b>মেডিসিন তৈরি :</b> হরমোন, ভ্যাকসিন এবং অন্যান্য ওষুধ তৈরিতে জেনিটিক ইঞ্জিনিয়ারিং ব্যবহৃত হচ্ছে।
            </li>
            <li >
            <b>ইনসুলিন তৈরি :</b> মানবদেহের ইনসুলিন তৈরির জিনকে ব্যাকটেরিয়ার কোষে প্রবেশ করিয়ে ডায়াবেটিস রোগের চিকিৎসায় ব্যবহৃত ইনসুলিন বাণিজ্যিকভাবে উৎপাদন করা হয়।
            </li>
            <li >
            <b>জিন থেরাপি :</b> জিন থেরাপির মাধ্যমে মানুষের ত্রুটিপূর্ণ জিন পরিবর্তন করে বিভিন্ন রোগের চিকিৎসা করা সম্ভব।
            </li>
            <li >
            <b>ক্লোনিং :</b> জেনেটিক ইঞ্জিনিয়ারিং এর কল্যানে ক্লোনিংয়ের মাধ্যমে নতুন উন্নত প্রাণি, যেমন- গরু, ছাগল, ঘোড়া ইত্যাদি সৃষ্টি হচ্ছে।
            </li>
            </ul>
            
                </div>
                <div className="col-lg-3 ">
                <div className="chapterLeft">
                {
      Chpt1SubDetail.map((item,index)=>{
        return(
          <Link key={index} to={item.name} className="mb-4">
             <h4 className='chapterOne'>{item.title}</h4>
          </Link>
        )
      })
    }
                </div>
                </div>
        </div>
      </div>
      <Newsletter/>
      <Footer/>
        </div>
  )
}

export default GeneticEngineering