import user1 from "../assets/user1.png";
import user2 from "../assets/user2.jpg";
import user3 from "../assets/user3.jpg";
import user4 from "../assets/user4.png";
import user5 from "../assets/user5.jpg";
import user6 from "../assets/user6.jpg";
import user7 from "../assets/user1.png";

export const ReviewText=[
    {
        title:"একজন ব্যস্ত পেশাজীবী হিসেবে, আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"Someone Famous",
        work:"Graphic Designer",
        img:user1
    },
    {
        title:" ব্যস্ত পেশাজীবী হিসেবে, আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"MD. korim",
        work:"Web Designer",
        img:user2
    },
    {
        title:" আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"Rohim Hassan",
        work:"UI & UX Designer",
        img:user3
    },
    {
        title:" আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"Rohim Hassan",
        work:"UI & UX Designer",
        img:user4
    },
    {
        title:" আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"Rohim Hassan",
        work:"UI & UX Designer",
        img:user5
    },
    {
        title:" আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"Rohim Hassan",
        work:"UI & UX Designer",
        img:user6
    },
    {
        title:" আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"Rohim Hassan",
        work:"UI & UX Designer",
        img:user7
    },
    {
        title:" আমার দক্ষতা বাড়ানোর জন্য একটি নমনীয় উপায়ের প্রয়োজন ছিল এবং এই প্ল্যাটফর্মটি ছিল নিখুঁত সমাধান। যে প্রকল্প ব্যবস্থাপনা কোর্সটি আমি নিয়েছিলাম তা ব্যাপক এবং সর্বশেষ শিল্প চর্চার সাথে আপ-টু-ডেট ছিল। বাস্তব জগতের কেস স্টাডি এবং ইন্টারেক্টিভ উপাদানগুলো শেখাকে উপভোগ্য এবং বাস্তবসম্মত করেছে।",
        name:"Rohim Hassan",
        work:"UI & UX Designer",
        img:user3
    },
]